[
  {
    "id": "Post Marital",
    "slogans": null,
    "points": [
      {
        "id": "Dedicated Team of Investigators for Post-Matrimonial Inquiries",
        "description": "Our post-marriage investigations are tailored to meet the specific needs of each client. We have a dedicated team of highly skilled investigators who are committed to efficiently completing their tasks. Leveraging the latest techniques and tools, our team gathers concrete evidence and facts. This expertise has earned us a reputation as one of Kolkata’s premier post-matrimonial investigation agencies."
      },
      {
        "id": "Unveiling Truths About Your Partner or In-Laws",
        "description": "The escalating divorce rates in the city often stem from insufficient information, making it imperative to take informed steps. Don’t let uncertainty jeopardize your relationship. Through our services, you can gain comprehensive insights into your spouse and their family. Upon your request, our team conducts thorough post-matrimonial verifications, uncovering truths that empower you to make informed decisions about your life. Whether you suspect infidelity or underhanded activities by your in-laws, we delve deep to uncover the facts, which can potentially salvage your marriage."
      }
    ],
    "description": "Are you looking forward to your upcoming marriage, whether it’s arranged or based on love? It’s normal to feel a bit apprehensive during this time. However, if you harbour any doubts about your prospective partner, consider utilising Innerwork Advisors LLP for private pre-matrimonial investigation services. Instances such as not receiving your partner’s home phone number, their reluctance to introduce you to their friends, or not knowing their home address can raise concerns. Even if you are in a wonderful relationship, it’s prudent to ensure everything is as it appears before proceeding further. Our team of professional private detectives conducts thorough fact-finding missions with utmost dedication. We offer comprehensive background checks and investigations, providing reliable assistance at every stage. Regardless of the doubts or suspicions you may have, we prioritize your protection and peace of mind. While it’s possible that you’re simply overthinking, ensuring certainty is crucial before entering into a marital commitment. Reach out to us, share your concerns, and let us assist you. We are confident in our ability to provide the support you need.",
    "conclusion": "Innerwork Advisors LLP stands as a prominent post-matrimonial investigation firm in Kolkata, offering discreet investigations conducted with utmost care. Our focus remains on maintaining the confidentiality of our investigations. We provide tangible evidence in the form of video or audio recordings and photographs, ensuring you receive irrefutable proof. Reach out to us today to uncover the realities within your marriage."
  },
  {
    "id": "Pre Marital",
    "slogans": [
      "We Provide Tangible Evidence"
    ],
    "points": [
      {
        "id": "Our investigative efforts yield one of two outcomes",
        "subPoints": [
          {
            "id": "Your doubts unfolded, and any concerns were merely misconceptions.",
            "description": null
          },
          {
            "id": "Your suspicions are valid, and the warning signs were indeed indicators that warrant reconsidering the marriage.",
            "description": null
          }
        ],
        "description": "Should you discover deceit or infidelity on the part of your prospective partner, we deliver concrete evidence enabling you to take appropriate action. Our services encompass video and audio recordings, as well as photographic evidence, ensuring a thorough presentation of facts you can rely on."
      },
      {
        "id": "Discreet Investigation Services",
        "description": "Innerwork Advisors LLP ensures absolute discretion and meticulous attention throughout the pre-matrimonial investigation process. Reach out to us without hesitation, sharing your specific requirements confidently."
      }
    ],
    "description": "Innerwork Advisors LLP offers all inclusive post-matrimonial investigation services that meticulously scrutinize all pertinent information concerning either the bride or the groom. Our investigations encompass aspects such as the background of the bride or groom’s family, or it may involve a spouse seeking to ascertain details about their significant other’s activities. Throughout this process, we provide unwavering support and assistance to our clients.",
    "conclusion": null
  }
]